The  OrdinateDimensionSetting  type exposes the following members.
 Constructors
Name  |   Description
OrdinateDimensionSetting
 Constructs a new OrdinateDimensionSetting object with default settings.
 Methods
Name  |   Description
Dispose
 Releases all resources used by the  OrdinateDimensionSetting
Equals
 Determines whether the specified  Object  is equal to the current  Object  .
 (Inherited from  Object  .)
GetHashCode
 Serves as a hash function for a particular type.
 (Inherited from  Object  .)
GetType
 Gets the  Type  of the current instance.
 (Inherited from  Object  .)
ToString
 Returns a string that represents the current object.
 (Inherited from  Object  .)
 Properties
Name  |   Description
DimensionLineLength
 dimension line length
DimensionLineStyle
 dimension line style
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
OriginTickMarkId
 dimension origin tick mark ID
OriginVisibility
 dimension ordinate origin visibility
TextOrientation
 dimension text orientation
TextPosition
 dimension text position
 See Also
  OrdinateDimensionSetting Class
  Autodesk.Revit.DB Namespace